Documents/Лео_ФиксацияСкидокПоТрейдМаркетингу/Лео_ФиксацияСкидокПоТрейдМаркетингу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ФиксацияСкидокПоТрейдМаркетингу</name>
  <basedOn>Document.Лео_ЗаявкаНаАкцию</basedOn>
  <registerRecords>AccumulationRegister.Лно_СкидкиТрейдМаркетинг</registerRecords>
  <registerRecords>AccumulationRegister.Лео_Скидки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <comment>Дистрибьютор</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАктивности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАктивности</name>
    <type>
      <types>CatalogRef.ТипыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВозникновенияРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитБюджетаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержениеФактаПредоставленияСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактаПредоставленияСкидки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокуменПредоставленияСкидки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>String</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопОбъём</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/абс_СостоянияСогласованияДокументов/абс_СостоянияСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СостоянияСогласованияДокументов</name>
  <comment>Состояния согласования документов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтап</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументДляСогласования</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
      <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      <types>DocumentRef.Лео_ЗаявкаНаЗапчасти</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПланПродаж</types>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AccumulationRegisters/Лно_СкидкиТрейдМаркетинг/Лно_СкидкиТрейдМаркетинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лно_СкидкиТрейдМаркетинг</name>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДопОбъём</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВозникновенияРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерАктивности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАктивности</name>
    <type>
      <types>CatalogRef.ТипыСкидокНаценок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

InformationRegisters/абс_НастройкиНачалаМаршрутовСогласованияДокументов/абс_НастройкиНачалаМаршрутовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиНачалаМаршрутовСогласованияДокументов</name>
  <comment>Настройки начала маршрутов согласования документов</comment>
  <resources>
    <name>МаршрутСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутСогласованияДляЗРССверхЛимита</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутСогласованияСрочныеЗРС</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ТипыДокументовДляСогласования/абс_ТипыДокументовДляСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыДокументовДляСогласования</name>
  <enumValues>
    <name>ВводБюджета</name>
  </enumValues>
  <enumValues>
    <name>СтратегическиеЦелиПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПланПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаБюджетОтделаТМ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРасходованиеСредств</name>
  </enumValues>
  <enumValues>
    <name>Лео_ФиксацияСкидокПоТрейдМаркетингу</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаОбразцы</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаЗапчасти</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаАкцию</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураПолученный</name>
  </enumValues>
</mdclass:Enum>

Documents/Лео_ФиксацияСкидокПоТрейдМаркетингу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Если используется механизм согласования заявок, и заявка еще не прошла по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Состояние = Выборка.Состояние;
	Иначе
		Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
	КонецЕсли;
	
	Если Состояние = Перечисления.СостоянияОбъектов.Отклонен или Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку 
		ИЛИ НЕ ЗначениеЗаполнено(Состояние) Тогда
		Состояние = Перечисления.СостоянияОбъектов.Подготовлен; 
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	//////////////////////////////////////////////////////////////////////////////////
	// Движения по согласованию:
	
	//Если используется механизм согласования документов , и документ еще не прошел по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	//Если Состояние = Перечисления.СостоянияОбъектов.Отклонен или Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку 
	//	ИЛИ НЕ ЗначениеЗаполнено(Состояние) Тогда
	//		//Ответ = Вопрос("Отправить на согласование?",РежимДиалогаВопрос.ДаНет);
	//	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	 Состояние = Перечисления.СостоянияОбъектов.Подготовлен; 
	//   // КонецЕсли;
	//КонецЕсли;
	
	
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу,Дата) Тогда
		Если Состояние = Перечисления.СостоянияОбъектов.Подготовлен Тогда
			Запрос = Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние = Перечисления.СостоянияОбъектов.Отклонен или Выборка.Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку Тогда
					МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
					
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					// Повторно
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период = ТекущаяДата();
					НоваяЗапись.Активность = Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
					НоваяЗапись.Этап = МаршрутСогласования;
					НоваяЗапись.ТекущийЭтап = "Начальный";
					НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
					Попытка
						НоваяЗапись.Комментарий = ДополнительныеСвойства.КомментарийИнициатора;
					Исключение
					КонецПопытки;   
					НаборЗаписейСостояниеСогласования.Записать();
					ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
					ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования, НоваяЗапись.Состояние);
					
					Возврат;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Состояние = Перечисления.СостоянияОбъектов.Утвержден Тогда
			ДвиженияПоРегиструСкидок();
			Возврат;
		КонецЕсли;
		
		Если НаборЗаписейСостояниеСогласования.Количество() > 1   Тогда
			Возврат;
		КонецЕсли;
		МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить новый маршрут согласования документа", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		
		//Первый раз
		НаборЗаписейСостояниеСогласования.Очистить();
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.Этап = МаршрутСогласования;
		НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
		НоваяЗапись.ТекущийЭтап = "Начальный";
		НаборЗаписейСостояниеСогласования.Записать();
		ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
		ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования,НоваяЗапись.Состояние);
		
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этому документу, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
	
	
	
	//ДвиженияПоРегиструСогласования(Отказ, Режим, Состояние);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
КонецПроцедуры

Процедура ДвиженияПоРегиструСкидок()
	//Если Состояние = Перечисления.СостоянияОбъектов.Утвержден  Тогда
	Движения.Лно_СкидкиТрейдМаркетинг.Записывать = Истина;
	Движения.Лно_СкидкиТрейдМаркетинг.Очистить();
	Для Каждого ТекСтрокаСкидки Из Скидки Цикл
		Движение = Движения.Лно_СкидкиТрейдМаркетинг.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Сеть = ТекСтрокаСкидки.Сеть;
		Движение.Номенклатура = ТекСтрокаСкидки.Номенклатура;
		Движение.НомерАктивности = НомерАктивности;
		Движение.ВидАктивности = ВидАктивности;
		Движение.Скидка = ТекСтрокаСкидки.СуммаСкидки;
		Движение.ДопОбъём = ТекСтрокаСкидки.ДопОбъём;
		Движение.ПериодВозникновенияРасхода = ПериодВозникновенияРасхода;
		//{Лео Катанович
		Движение.ВидОплаты = ВидОплаты;
		//Лео Катанович}
	КонецЦикла;
	
	Если ПодтвержениеФактаПредоставленияСкидки Тогда
		Для Каждого ТекСтрокаСкидки Из Скидки Цикл
			Движение = Движения.Лно_СкидкиТрейдМаркетинг.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//Движение.Период = ?( ДокуменПредоставленияСкидки.Дата> Дата ,ДокуменПредоставленияСкидки.Дата,Дата) ;
			Движение.Период = Дата;
			
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Сеть = ТекСтрокаСкидки.Сеть;
			Движение.Номенклатура = ТекСтрокаСкидки.Номенклатура;
			Движение.НомерАктивности = НомерАктивности;
			Движение.ВидАктивности = ВидАктивности;
			Движение.Скидка = ТекСтрокаСкидки.СуммаСкидки;
			Движение.ДопОбъём = ТекСтрокаСкидки.ДопОбъём;
			Движение.ПериодВозникновенияРасхода = ПериодВозникновенияРасхода;
			//{Лео Катанович
			Движение.ВидОплаты = ВидОплаты;
			//Лео Катанович}
		КонецЦикла;
	КонецЕсли;
	
	//КонецЕсли;	
	
КонецПроцедуры	


Процедура ДвиженияПоРегиструСогласования (Отказ, Режим,Состояние)
	//Если используется механизм согласования заявок, и заявка еще не прошла по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	
	
	
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу,Дата) Тогда
		
		Если Состояние=Перечисления.СостоянияОбъектов.Подготовлен Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
					
					МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
					
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период 					= ТекущаяДата();
					НоваяЗапись.Активность 				= Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь 			= Ответственный;
					НоваяЗапись.Этап 					= МаршрутСогласования;
					НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
					
					НаборЗаписейСостояниеСогласования.Записать();
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования
			Возврат;
		КонецЕсли;
		
		МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования заявки", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		
		НаборЗаписейСостояниеСогласования.Очистить();
		
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период 					= ТекущаяДата();
		НоваяЗапись.Активность 				= Истина;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь 			= Ответственный;
		НоваяЗапись.Этап 					= МаршрутСогласования;
		НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
		
		
		НаборЗаписейСостояниеСогласования.Записать();
		
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Удаление движений по регистру СостоянияСогласованияЗаявок, если заявка была подготовлена
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если НаборЗаписейСостояниеСогласования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств,Дата) Тогда
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования, не следует ничего менять
			Возврат;
		КонецЕсли;
		//Если в наборе записей только одна запись - значит заявка только подготовлена.
		//Очистим набор записей
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
КонецПроцедуры

//Функция определяет маршрут согласования документа по подразделению
Функция ОпределитьМаршрутСогласования(ТипДокументаДляСогласования)      Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласования КАК МаршрутСогласования
	|ИЗ
	|	РегистрСведений.абс_НастройкиНачалаМаршрутовСогласованияДокументов КАК абс_НастройкиНачалаМаршрутовСогласованияДокументов
	|ГДЕ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования");
	
	//Запрос.УстановитьПараметр("ТекПодразделение"			, Подразделение);
	//Запрос.УстановитьПараметр("ПустоеПодразделение"			, Справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования"	, ТипДокументаДляСогласования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	
	Возврат Справочники.МаршрутыСогласования.ПустаяСсылка();
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (НЕ РольДоступна("ПолныеПрава")) и  (НЕ РольДоступна("Финансист"))  Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Состояние = Выборка.Состояние;
			Иначе
				Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
			КонецЕсли;
			
			Если Состояние = Перечисления.СостоянияОбъектов.Утвержден Тогда
				Отказ = Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Ответственный = Справочники.Пользователи.ПустаяСсылка()Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//ПодтвержениеФактаПредоставленияСкидки = Ложь;
	ДатаФактаПредоставленияСкидки = Дата("00010101000000");
	ДокуменПредоставленияСкидки = Неопределено;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лео_ЗаявкаНаАкцию") Тогда
		
		ДополнительныеСвойства.Вставить("ОткрыватьФорму", Ложь);
		Если РольДоступна("ПолныеПрава") Тогда
			
		Иначе
			Если НЕ (ДанныеЗаполнения.ВидКомпенсации  = "Компенсирующая скидка" И (ДанныеЗаполнения.Состояние = Перечисления.СостоянияОбъектов.Утвержден ИЛИ ДанныеЗаполнения.Состояние = Перечисления.СостоянияОбъектов.Лео_ПроверенФакт))  Тогда
				Комментарий = "Не открывать форму";
			КонецЕсли;
			
		КонецЕсли;	 
		
		Организация = ДанныеЗаполнения.Организация;
		ПериодВозникновенияРасхода = ДанныеЗаполнения.ДатаОкончанияАкции;
		ВидАктивности =  ДанныеЗаполнения.ТипСкидкиНаценки;
		Контрагент = ДанныеЗаполнения.Контрагент;
		НомерАктивности = ДанныеЗаполнения.НомерТМА;
		ДокументОснование =  ДанныеЗаполнения.Ссылка;
		ВидОплаты = ДанныеЗаполнения.ВидОплаты;
		//Скидки.Загрузить(ДанныеЗаполнения.УсловияФормированияСкидки.Выгрузить());
		Для Каждого Строка из ДанныеЗаполнения.ЭффективностьФакт Цикл
			НоваяСтрока = Скидки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Сеть = ДанныеЗаполнения.Участник;
			НоваяСтрока.СуммаСкидки = Строка.БюджетПоставщикаСНДС;  // с НДС
			НоваяСтрока.СуммаСкидкиБезНДС = Строка.БюджетПоставщикаБезНДС;
		КонецЦикла;	 
		ЛимитБюджетаБезНДС = Скидки.Итог("СуммаСкидкиБезНДС");
		СуммаДокумента = Скидки.Итог("СуммаСкидки");
		
	Конецесли;
	
КонецПроцедуры
